# -*- coding: utf-8 -*-

# Вывести на консоль жителей комнат (модули room_1 и room_2)
# Формат: В комнате room_1 живут: ...

from lesson_005.room_1 import folks
from lesson_005.room_2 import folks as folks_2

print('В комнате room_1 живут', folks, 'В комнате room_2 живут', folks_2)



